{
  "blueprintString": "H4sIAAAAAAAA/5Xa327iOhTF4Vepek0r/02MKp6lSmk0QqIJgiC1Qrz7QJyj0yGB/NZN56LfBMd7sePY/Wyftu262j69r0510226TX1YnU5N9VWvng/tttq/\n7Kqm3j4vdu3h8tu2WZ2+Vy/WLn4uP9P5vJi1idPIqcOUDzVgWfJPN/yebB5ASS7rMb2o3oZf9vhx6KorGI3gNdfg8i+6dJ5cZBOnkVOHKR9qwLLkn25G9E4R\nrJdqYItRde+XK8+WI3bJacGpH9F7UTTDLDg0C/zGIpYJy+FrgGbA5staZCO2Q+9AtBRG0I+Wda/IaV+u5f+0Wq+PX8dt1bX722zlGCx/p+C+DpJ2kjaKtgr2\nCo4TeCaYS5wf9EQrxToXZHaX+bYKVosy65LpKGkvaatoo2Cn4KDgQsFpojAzeSt4Z2GrjHhDZ2MUpBjFV/BY/i9FUUoR1FbRRsFOuMWgXLhQcJooy0wrQrLk\nGerjxp7QkdO+wXkhmU5KppcaHNRe0lbRRsFOwUHBhYLTRGFmGpzHKUarx/JW3n09G6bMsNItJT1EzkqRg9pP6H370e7afTe9zGKDdsoogoILBaeJMd99vbNT\n+HHf4i8LTF67luMJgkXOAYJpiwr2AnaCDYItBJvG0/a4o6A2EWB9+37C3+7YzkH8V85FBj5ccmTgMzEq2CvYCtgI1gk2CLYQbBrX43HESB76iPEtJ+FpBRfM\nOTiBNNwhN/CVwCvYCtgI1vG7C8JlC8GmcTUetzD+NGOb1hHLa8ISDw3cYogK9gq2AjaCdYINgi3G9nEU0C5SgPXtWw0LQr9UMnytZEi18t0nZf8RYqdgI2Ar\nWC/YOLYzqxVSjLxcYWW7ftXZxvUSywJLfysfn11YtgDE9xQpTBT231Z4ENBXyYObH84QLVty5CNEdnyVsIxYOirxMAOFJf5ocysfHx3Cqe9PDi3Zy8gn05bs\n6/YH00gOlUetPWEZsXRU4mEGCkv80WaQ58Vm3TbXP804bP401XZ16n52l/+56eqv58X4KhfffNbf19fA89u+7o775un9rW4+/wJfwt938SEAAA==",
  "createdDate": 1515543827388,
  "fileName": "SolarBuild.png",
  "image": {
    "id": "LSGM0NT",
    "type": "image/jpeg",
    "width": 1500,
    "height": 1083
  },
  "numberOfFavorites": 1,
  "author": {
    "userId": "bRONYpfjI2e0udlSNuwgszD3xkE3"
  },
  "authorId": "bRONYpfjI2e0udlSNuwgszD3xkE3",
  "descriptionMarkdown": "[Ripped from forum user golfmiketango](https://forums.factorio.com/viewtopic.php?p=232443#p232443). I just wanted it converted to 0.15.\n\n```\nI've been working on making a different kind of solar build -- one optimized for \"fun\", so to speak. Instead of min-maxing material and spatial costs, my goal is to optimize around playability concerns:\n\nFirst, I hate the sound of accumulators so I have pushed them all into the middle of the build where they will be seen but not heard (as much).\n\nSecond, I don't like having to predict the future. So my build leaves space for a train track with signals in-between the tiles, in both the vertical and horizontal directions, and even enough room (well, not quite -- a small amount of futzing around with pieces is necessary) for a train to turn a corner within my solar farm.\n\nThird, if I want to build some solar, I want it NOW. And, chances are, I want a LOT of it, more than I could carry in my inventory and anyhow to big to stand around waiting for personal roboport-bots to get it done. So my build greatly increases roboport density compared to, i.e., Madzuri's solar design, and leaves room to add even more roboports in the corners if necessary, so I can just shove everything required by my build in a provider chest, stamp down my blueprint, spray some bots, and leave.\n\nFinally, I wanted something that was four-way rotationally symmetric, so that if I had to patch up a botched deployment, I wouldn't have to use the zoom command + squinting system to figure out if I had the right orientation when re-blueprinting.\n\nNote that, although I'm using mods in the picture, none are required, this is a vanilla thing. I am leaving two tiles of space between the \"stamps\" but I could think of reasons to use different spacings ranging from no gap up to six tiles, depending on what I was trying to accomplish. Since there is ample roboport coverage overhanging the build, any reasonable spacing arrangement should work just fine.\n\nIIRC the blueprint includes some rail tiles for alignment. If not, you may wish to add some -- otherwise, your odds of randomly placing your solar farm in a position that will prevent you from laying rail between the tiles is 75% since you run a 50% chance of missing your mark in both the horizontal and the vertical dimension (unless you leave even more than two tiles of space between the builds, but then when you lay your rails they'll be asymmetrical and ugly).\n\nI think the optimal way to deploy them is to have an existing robot network in place, and the required solar panels and accumulators in logistic storage, preferably nearby, but not too nearby, but be holding the required roboports and substations. This way, your personal roboport bots can quickly place the substations and roboports, leaving your network with the task of laying down the solar panels and accumulators. In a large build, with sufficient construction bots in the network, this approach will prevent you from being nagged about \"missing robots\" or \"missing material for construction\" and the build will go much faster as you won't be waiting for robots to build out roboports to bring portions of your build into the network. By leaving a bit of distance between your storage and you build, you can also prevent your network construction bots from sealing you into the build forcing you to pull it to pieces to get out.\n\nThe build has 84 accumulators and 100 solars (plus twelve substations and one roboport)\n```\n",
  "lastUpdatedDate": 1515620318951,
  "tags": {
    "1": "/mods/vanilla/",
    "2": "/version/0,14/",
    "0": "/power/solar/"
  },
  "title": "\"fun\" solar panel array"
}
