{
  "blueprintString": "0eNrtW01ym0gUvkqqlzNSiu4GIVQzCzlZzyLObiqlwlLbpkoCqkGeuFwcILeYzVwsJxlasi3UdNPvESxp4U0qCPjo977+3p/hidystyKXSVqS2RNJlllakNnfT6RI7tJ4rX4rH3NBZiQpxYaMSBpv1JGMkzWpRiRJV+I7mdFq5Lyl2MSyHJf1nem4KLO8cTsD3B7LpLzfiDJZjpfZ5iZJ4zKTDQwOwFiJZbIS0gzgV99GRKRlUiZi74PdweMi3W5uhKyNtJoyzmX2/XG8jOVdVj8tz4oaJEvVOmrgMZ18DEbkUf3vY1A/cJVIsdxfMBmR2uXp/rBQN1D1jxSr5gqS+mhSfasqZaO2KuZYVed62G499QpKma0XN+I+fkhqp9TXLRO53Cbloj63er35NpFFuWg5+SGR5bb+5bCS3RX1ImJ15/h5qfsn1T+qveapg00eyx0LM/Lzx7+kqsDeCCze4PbtZvLDsxdMnLQ8soNaKKhcrOBO+Io2a0SeHVeDEION/usjXtzZ3NAGM/3j7Wcy7jZZl0JapI/hd6vIpV4jMnyzmH8nhUihuzx4ffZGrJLtZizWNZ6sg0GerYXJaN7a4xACeOPZ6phpx9HoVRmm05SpIGK0TJ0ymjbpbxrFmEa1tYbHpuinKbWa4nc7xYRktDzsCswGu9krpZZd/AxzCFpFj6i1zv4RRTm+3Yr1cchinh60/qhvzrZlvkXAX+9B88fFTiyLW5ltFklaY5DZbbwuBCJcTDRPT3UilPaY5eapvpXNJE2RJNGTkLSP63H5EoOOmaIaT3+emacQw0vYHWKiNpaJtghJm9ekrZEM/Tck8VrT1wCsmVKSkcJSbjEMtsUysicwO7e2skUlTAxd4RnYenvJeQNKzpp0KMXm20m/dOt1Z0U9dlPuyKK+47wjnzOvY89qUFM3lNm3rLdvUVVaoC944ijLIqvtLihqgDLbznESDi6tmPn5478zp0nanRh1BdgqFurjmPDfKxY0FdwhuABIVYCjip+EKq+bGzWqOA07cCW4gpjF/ROc+9n5i0R+wUWiYdd3DQM65GXVC7Zlfk8yyMjGKDByTR2T6TYZyBbrAPtr7LR3eyEU4OIowmW5kC9Dx996UERJVWEGfU0ajBfoRFhjWISsOb1eJSfVY2x7fdr5aZf629eah/teX+NwvUpr8cxhnL2gpqZrzcZRVDA7TSyzqgWjhLMVDFaCO/gyzAE7MpNjOqVvHFv4ZAzFPXsv0duZytN9zzFjxnai60azMonre/nZmMTq+OoCdeyMy60hkU32zMfIvi1r7bnAhoP52KrJ2ZwPVSZ1bJmjv1o3C6Xfe2yHK3uhZHK8XdNmWjmQCFzjPTmJaufuVwTw/p4PKb8AJwP9PHcMF3mIEmXgCAYhcC/gpgDB+YcA/gCpeNB9wX+NNwsvITZYTs/TYc57p9dmMJ3/9bkHjV9w4dQhYE4xRLblbM221gZvimzwwn7da6Qb6tsbgsgRR5gBy2xc1Nc4VPfaKoR5YCfCdK35TTIPqz56pgEPqHIZYMTzCSU1jqxcOLBy4bipQXSSyuUN3mS4GjA/cVx+AtYNHNfDU3ZxLy14F9bSc8c7ALtg1ZGPgC07x7Xsx690nZE4bInx6QI7eO54LYQzaE2hIzlqFYp7rnXv+Micfnj7GFWxdIzPrcUUD3qvDVdwRL1Jsw7DOa4Jo6eZo30ZfgQ6H+7vrdgG2KEQaNpDt2U0OH9fdiBxPEApOMeVgpO3aI/5oXUqVLa4uy/Hu8+SrB96eMfeZybQCA7qQ0F9Dw7KwKAUDuqBQRkYdArG5GBMME2+D8aEsxSAMeEkTaCYcIpCKCR8lWAlwZ0J1hGY8wCsIvDWDMAagksoAEsIrvUALCF4UArAErJFz7rG2X1eOWt8Qzoi6/hG1CmEXKvv74T88FUV8h8+izxTZx+ELPYf2U1DxqY08kJWVf8D2P4F7w==",
  "descriptionMarkdown": "# Mods Required\n[Smarter Train](https://mods.factorio.com/mod/SmartTrains)\n\n# Additional Recommendation\n* Use my [FILO 8x Memory Cell](https://factorioprints.com/view/-Lag3YtvdjdTYHjTwACH) to store up to 8 stations requesting a train and outputs the most recent.\n* Use my [Station Requester](https://factorioprints.com/view/-Lb7SYkfF-t2wwXWU1EZ) to request and store in the Memory Cell the stations requesting trains. \n\n# Inputs:\n* Top Electric Line (Green) = Requested train stop\n* Bottom Electric Line (Green) = Refuel train stop. Set to 10 using Constant Combinator\n\n# Outputs:\n* Top Electric Line (Green) = Reset pulse to be used with FILO Memory Cell\n\n# Additional Blueprint help\nUse my other FILO Memory Cell blueprint to store Train Stops that have requested a train. You will need to convert the output to a train stop and connect it to the green wire on the top electric pole. The reset logic sends a pulse on the same green wire, so just wire it to the reset also.\n\nIf you don't use it, then you will need to send a constant signal on a green wire on the top electric pole.\n\n# Usage\n* I am using this to transfer ore to the smelters and to refuel as needed.\n* Each ore patch is named individually in a uniform pattern: IO1, IO2, IO3; CO1, CO2, CO3. Each station at the ore patch shares the same name. So, if one ore patch has two stations, they are both named IO1.\n* Similarly, each smelting outpost is named individually in a uniform pattern: IP_IO1, IP_IO2, IP_IO3; CP_IO1, CP_IO2, CP_IO3. (All my stations start with what the outpost produces_what the station supplies. For example, Green Circuit outpost would have GC_IP1, for Green Circuit outpost and this specific station supplies Iron Plates.) Each station at the smelting outpost shares the same name. So, if one outpost has two stations, they are both named IP_IO1. Loading stations at smelters are just IP1, IP2, etc.\n* Refueling stations are named Refuel to conform to Smarter Trains mod.\n\n**Smarter Train Setup**\n* Each ore type is given a station mapping range of numbers. Iron Ore=100-199; Copper Ore=200-299.\n* All unloading stations at smelting outposts are given a range between n00-n09. Each station at each smelting outpost shares the same station mapping\n* All loading stations at smelting outposts are given a range between n10-n19. Each station at each smelting outpost shares the same station mapping\n* All ore patches are given a range between n20-n98.\n* The ore depot is given n99.\n\nAs an example, my current setup has four Iron Ore patches (IO1-4). Each of these has just one station and is mapped to 121-4. (IO0 depleted) I have one smelting outpost with two unloading stations mapped to 100. It has two loading stations mapped to 110. Refuel is mapped to 10. Depot is mapped to 199.\n\n\n\n# Station Volume\nThis setup works ok, but I need to figure out how to actually manage the volume at stations. If you overflow the memory cell, the volume of ore at stations can back up. And if a station repeatedly doesn't get stored, it can be dropped.\n\n# Expandability\nOriginally I had said it could be expanded for more than one Depot. I since changed my setup to have a stacker feed to one Depot. (I have one Depot for iron ore and one for copper ore) I was having some issues with multiple trains leaving at the same time, so I am just using one Depot and a stacker. This seems to work much better and I don't have any issues.\n\nBut, I am keeping this note here in case someone decides to use multiple.\nI tried to make it so that it is expandable for more than one depot stop. You could theoretically have a stacker that feeds everything to the single depot. However, this can slow things down since each train has to check whether it needs to refuel at this single depot. If you have the depot set at the stacker, then each depot checks its own train and can send that train to refuel without waiting.\n\nIf you expand it, you will need to connect the green wire on all the top electric poles and the green wire on all the bottom electric poles. Also, the fourth decider combinator needs to be wired to the seventh Decider Combinator on the next depot. This logic sends trains in order. This gives precedence to the first train, then second, then third, etc. And finally, you only need the constant combinator on the first depot. This is the Refuel station. If you have more than one, you could use a Constant Combinator on each line. If you do this, do not connect the green wire on the the bottom electric poles.",
  "fileName": "SmarterTrainDepot.png",
  "numberOfFavorites": 5,
  "tags": {
    "2": "/train/loading station/",
    "3": "/train/unloading station/",
    "0": "/mods/vanilla/",
    "1": "/version/0,16/"
  },
  "author": {
    "userId": "hpChOET0KqTpRCnTetn2oXJDIW73"
  },
  "authorId": "hpChOET0KqTpRCnTetn2oXJDIW73",
  "createdDate": 1553434067620,
  "image": {
    "height": 265,
    "id": "JtXkam3",
    "type": "image/png",
    "width": 894
  },
  "lastUpdatedDate": 1553846470126,
  "title": "Smarter Trains Depot",
  "favorites": {
    "qJP1Pt2LIgOfWGVKnTNSRmOeeX42": true,
    "v7YEnQSxeYS0S7azulrYxKWsxZ32": true,
    "1sPvUkBfeLRMHhLyEjzZHtILxGt2": true,
    "Ql65HCEd9lYi4tHwa1DlDOrQoZH3": true,
    "IRisceJpWRaKGnXzbvksxfHGqIf2": true
  }
}
