{
  "author": {
    "userId": "cpneYD8vY9T04McVqSLHrZw1uUD3"
  },
  "authorId": "cpneYD8vY9T04McVqSLHrZw1uUD3",
  "blueprintString": "0eNrtXFuO47gV3UrBn4k1EKmnC0k+ZjABAkyC+Q8aBi1TNtGypKEkz1QatYDZR7KxWUkuJdt6kRIpu6o6j59u2GUdkvd57iWpL6tdUtGcs7RcPX9ZsShLi9Xz37+sCnZISSK+K19yunpesZKeVutVSk7iU0EtnkWfaWklpEqjo5WT/ep1vWLpnv6yekav61kIQpjV/MTiNKLsTHkHAb9+Wq9oWrKS0WZG9YeXbVqddvDLZ3QD2tOI7Sm3ouy0YykpMw6D5FkBj2apGB7gAvsbb716gcd8HwbZMxiy+bO7XsGiS54l2x09kjODx+GZC+gW/ravgQrxbcx4UW5HCzszXlbwTSueZl3fiwUJkZZEyNcTH0454fUcn1e//foveCSryrwyAD1wStMGOH+B+VVpuY15dtqyFHBWzzFJCvraDJw2q6znjsQ/nO67wmTwCcMvGY8qVtYf0esneBaLHzcjTf8c9PT6KrQ9UA82Uw96X/VQKyL8kF1suK8lNNDSH78CHaGhjta9P3szOkNDnfUfdxU6dNplVTuQTq2Rke78zUVzIcwhpexw3GUVFz7rrj33kwTXbXFPJEksxrPUognIgbPIyrOESiwE3ywk+MZTSE7PYMeyG07cWQeyeXvT4U8y52bGgXuHN/ZnizeDLxxPBErpwt3BT5E3/MIfGkIwPbqPGmGV5FAvIiHgfelhC6vfXiTzl+REIJvQ9OmH5o9PP5L9k/X01yopWV5xEJHQbiO2LSj8cBCiXTX+GFdJx5n+RqozK+DzP7KUjgZYyUzW1zLZ8GKygT3UPMJrH8l0H9yAT3TPqtOsvQZXexWxbewZCMtGCdvplyT6bLG0oLykfBLfrvE7MRPLY+ZVs7eYuSCjdQKbKl6KrPZq4qBghvL4s+lIg9LEio60KCWiCAei0A2qQWPNO8L7pn6jGLa+OsKBurspTAbd0hee7bI845KFhdf4gWXSQdjQJEN3MEfdkORIUv7AoH15xETOJN0bTXHTTtG9TnFkx5xCuEmyAytKFhXXZGpgcI4zzAFOP65FRwJQyWy0QW0mu86nMVJY4k8V/C9bo+/d1ujUa6ztD4OtXR7axiyBJxvWe6XDKu5iFRczE+uvhD9i+1WqCk/bmH1/MMOOMfv3x5ZRJSFdTz/G2PYgyvzBLMZ4ihCD/CURF/+HR9whEQiHLMNWiStYYPCd2IiVTn0V1Snb020Wb7Oc8iZ7i9CsG6qG7AiP+JOjV76gcEnoF94iA2sTGQST8niitdwm6qEwNPS/Fve+ipWS6CiMDbwQYLatzVlgdB2drH63oCpqwI0sFc+VNtgdl6/SetRe4ujufyu1wsiYW7kP5Va4zWikKOhpl0CtYJ3AQiDbWo5kJpvbTPx6JqATlk9kEKtKc1A0IImEU8+2yCndWxBiqkSMAcxMNjPHqHURupdZeZqu+pDO0o99Q7Ee0bSgQMleSpD/YaJzUfKKmnmwO464F4eW2c2wPG8MSaYm10xN/keoKWfp58d3l95GUSJLTTZKsFKRcsU7mpG5JaZXMc3kRo0aoUuh5/rQ0pT8euPTlmcb9bUl1igHwxpgMol00GpefIFzdOF41cRHUXiWKjRXAy2vTrnqeU/jeVXgFmGb7vtSa5F9DWSILNbP4OKD2bUggQZIbdXTMKHeKgtYkVhrXkDi6YPdoDY66ktYHFv0lzwBlzjTQiV8ZOvMK0sIB1mLQle1PqS1kRNF1alKxpbewdGx9aYZnJC+UTldGB0bh99WYOQMAmVc8RQk34Vzu3A6Rn6k5PxiZSyxgMvwvqy6kUHHLLM4Lo4Zp9bQc7pAOjZ1cZi4GujO6ylPx6R2IPMMfC5hh2MvGOAOUtNSWJ5KRlWYkpb6i3OB95BcIKOiKpvWcdgjPbFIEIFEZH8Fko5z3Hp7Epv2DLPADevEUrHUPWdJz46wZ5oJOHBqsIwzKLPl16qoopUb+lRdBaXjdTuoO68NpbHAAr0QLt3tloTx0BCu3iOZwNPxYcIpUerSMw3nnECsu/zmnnBe40RHwtI5NB2bTTKIAxlYGFUmPR1DbfjGz+SgNgikZZ4QjsiBWhChPquiplZKiJOK7ccT6i1Mx0SlWwD9iRnmGGGb8cCYkHF+GbQJd1UcUyWFNc0zeNjIdJTHEZSNSyLCFmRknp0FbZ/s1/vy/h4Ol7TWfZ19IrxZ0rby36Bt9cZde0kvQNWzd/RbeSGakIkMGi3ob4d41JlS7uMg3eJnbjvHwYuZkv8IpgS0uIRKROyUHdQOrZNv0ipKKFQikMSiQQkRGlGkekq56AkqygdHK7BTcrLKioMkqSqyuyaBb1RmY0MqVB+PAQJZ0rtoUNPnncbRyTSAUK9LtHbvqYuhjOW0KKwKHuEHDjB7a0cTJUve6DErUROBLcWgPv7SswTPsECOwOU4i6sDVZVqyDwBXoiDkjNoMSuaE8brSKFOznrGLsJn4/VtFFXxIleT2tLoJapLqJhELIGg1V+sGdGqOEkFsanVGtERtzWkWzC/G0XaQVE/Ebo0C4O8Ss6Us6KPhE3ZlrpSRKaUS/QqZA5wF9MaHhVzHFV2dhYnpuARiSnJwPIgK+2hfJw16Yc2KZFhSd85oXZHMX87PnRHI5eTPeH3dHJLXpd5ZabsB/uaFeNdqWnHDuoKyDhBSaiEWTYSAFaZWU1yU4dqWztUywzaNW7YXjMvaC0thO3I8q5p87azi3xfnd9Llzkpil55dk9yUlL6ezoBM+WkKpD7BnoqcsiiU/PU8Y0YWNuExs37AzXgFHkzbxbUkHOrNU1dzmhLWZm67jzOF2of50Pq3aHbopG87lt0jC98j2N8kl0u1a73Y/oA/oJ7BB2hbMbnsuX3FZygnxPGoEEPVAYRzkGEsxCbOYjNHIRrz0C016SUEGgOAs1C4DkIPAvhzEE4sxDuHIQ7C+HNQXizEP4chD8LEZhdtdr0zH++SfiQgzB/HtyEG3UGl5yD+XbpDSutQ7FeYHYxzgv1zru4ofFpUKRS2UedBh0cBv39+xwGHUoYP0ojG7OjZM5HeNC30xn1TwtUIK7+PtaFTBVk6ynIs80U5H2EglppXnWEHxDj+LXH8CAVuXOn/DZmKvR1VYiMo17w/6gnk/DDNGJ2RTv8EN5wM/+rDh7BG9pTuQ9yKlMV6V5a8PRuYG8uCSm0jQ5pOYrbvf2LfdLbsJ6rdzX8cug6xOMb1lC9KbA99XbORM0T4tGtgIT9JA5XdA/LdS4DyM8sPTtSRfgGc2oLh7ed0zLeH9rv6b/fvwXv/+6xGfGNeL4XmsVX9BH6GbBK7I4U9Nuv//xqrigMVTV6kUU4Q24CszjthtPnWN2Zc67eRtNUlhUg72sq3/0PFyC+YQESfISCRlwJo6/am72Z19J4hqzKm3tLDtZUNtIiN8Hljm7o3tVlciSkC+gVUD9fxo58PDzXPMWJmqNeyvuPoXT5jv6Rw1uvN/R0TjP6rj40NoT25rY3p2avdTjQ9+8ZIpB3b/3AHBQbztvgLrujhvZl0Bvtjdspmux3N85kL9+xjYXUbsuFoY6QAmQ+hGs4BDYfIjAcwjEfwjccwjUfYmM4hLkvt9tnmkMs8GXbcIjgnnAhhhBv9qp3WZ87b2kU787a1e+m6b5S6+mHjICXPZ3FzXnI1kUzrRC5wQYHnosczwbAfwMaRWXQ",
  "createdDate": 1651630732766,
  "descriptionMarkdown": "Easy to use loader with some extra circuitry to make life even easier.\n\n\nI've created a fairly dense multipurpose cargo rocket loader that I wanted to share. I wasn't finding any equivalents in my searches online. I'll give a run-through of it's features in order of complexity. The piece I'm most proud of is the timer which prevents bots from receiving requests to fill the chest until the rocket has landed at the destination. Forgive the out of order numbering.\n\n1. Constant Combinators provide a negative value representing the desired amount of various materials at the destination. As an example, I want to keep 500 stacks of rocket fuel at my outpost planets, so it has -5000 Rocket Fuel as one of the many values put out by the 4 constant combinators. These values need to be subtracted from the inventory of the destination, so they are entered as negatives. The arithmetic combinator above takes the signal from them and from the Signal Receiver and multiplies the values by -1 so we can end up with a positive value to feed to requester chest further on (2).\n\n\n2. These 2 Decider Combinators enforce two conditions;\n\tFirst, the Cargo Rocket must not have been sent within the last 35 seconds. This is to prevent 'in-flight' items from being missed in the calculation.\n\tSecond, the destination must have power, or no values will be passed. This is done with the 'P' signal being received from the destination. This is required because in the case of a power-outage, our negative values won't be subtracted from the destination inventory, and we would be requesting the complete list instead of just topping the items off.\n\n\n3. The requester chest receives the values to load into the cargo rocket silo. I added an extra pair of steel chests limited to 1 stack with matching stack inserters to speed up loading, and connected circuits back so that the system counts anything thats in the chests as part of the inventory of the destination planet, so we don't have excessive requests to the logistic bots network. (ie. if I'm requiring 2000 Iron Plates, and there are 400 Iron Plates at the destination, 500 in the Cargo Rocket Silo, another 300 in the requester chest, and 100 in each of the steel chests, the total request to the bot network will only be the remainder, 500 plates.) The contents of the inserters are also counted.\n\n\n4. These Decider Combinators have two conditions, and ensure there is enough space in the rocket for the Cargo Rocket Parts and Space Capsule to be provided. If either of the two conditions are met, the inserters for group 3 are allowed to load materials.\n\tFirst condition, there must be at least 5 empty inventory slots.\n\tSecond condition the rocket must be ready to send.\nThese enable the inserters to load up the first 495 stacks of items while you're waiting around for the Packed Cargo Rocket Parts to unpack, and the Space Capsule to load in.\n\n\n5. This is a simple requester chest for Cargo Rocket Parts, and the inserter is rigged to only load if Cargo Rocket Parts are less than 100.\n\n6. This is a failsafe for when you're offworld - if for some reason the system gums up or you put a bad decimal into your requests, you can turn the inserter and empty the silo into your logistics network.\n\n7. This is a simple requester chest for Space Capsules, and the inserter is rigged to only load if there is less than 1 Space Capsule.\n\n8. This belt feeds Solid Rocket Fuel. It could easily be replaced with a requester chest or two. I allow extra Solid Rocket Fuel into the provider chest, because I often am sending rockets nearly full of Solid Rocket Fuel, and it keeps the bots from moving too far.\n\n9. This is the most complicated bit. This series of Decider and Arithmetic combinators triggers when the Cargo Rocket is fired. The first two Deciders watch for Empty Inventory Slots = 500 and Full Inventory Slots =500, respectively, and load a value into the next set. The next set counts infinitely until both of the previous conditions exist, and then for 2400 ticks, which is 40 seconds. In that 40 second window it passes the values on to the next set, which creates a 'red' signal, and when the red signal is created, another timer kicks off, counting for 2100 ticks (35 seconds). After 35 seconds, the value is wiped away, but as long as the red signal is greater than 0, a Pink signal stops sending to the first combinator in square 2. If the combinator in 2 doesn't receive the pink signal it won't send any signals further along into the system, thereby preventing any logistic requests from generating.\n\n10. This is a simple requester chest taking in Packed Cargo Rocket Parts and loading them into the rocket until 100 Parts have been loaded.\n",
  "fileName": "Multipurpose Loader Explanation.PNG",
  "image": {
    "height": 942,
    "id": "fBp82nP",
    "type": "image/png",
    "width": 1776
  },
  "lastUpdatedDate": 1651630732766,
  "numberOfFavorites": 2,
  "tags": {
    "0": "/mods/other/"
  },
  "title": "Multipurpose Loader",
  "favorites": {
    "spzKhCVZrFPB7v600KgV8dLAFD73": true,
    "WO20LJAcWdNE8VvaJG2tc2F4wDj1": true,
    "gDgX4de49wbL7ASlahMaidkarNG3": true,
    "vKwPBTCbI5YEFfspuxD064QgnRu2": true
  }
}
