{
  "numberOfFavorites": 3,
  "title": "Belted Kovarex - no circuits, no buffering",
  "authorId": "duVWG6DfCxMHjqWcEQen4cnW4WA2",
  "fileName": "kovarexchain.jpg",
  "imageUrl": "https://firebasestorage.googleapis.com/v0/b/facorio-blueprints.appspot.com/o/beaconed.jpg?alt=media&token=76cedfb8-7c52-4da7-ba63-31bd5ca4f7fa",
  "descriptionMarkdown": "Uses custom stack inserter sizes and simultaneous pickup of all output to prevent internal buffers from filling by passing on production.  (The first sends 40 around and 1 onwards, the next sends 39 around and 2 onwards....the final filter stack inserter is a full 12 and this is the output every cycle from that point on.)\n\nExpects U-238 from right to left (you need to arrange for that belt not to backup), feeds u-235 through centrifuges left to right but expects no input after first 40.\n\nIf you shorten it then shorten from the output end or it will break.  \nDo not reverse the u-238 belt as doing so risks a full lock-up in the event of u-238 shortage.  In default config it degrades more gracefully by starving the top of the chain first.\nBoost speed evenly over running units, or with higher values at the bottom of the chain (where they dont help, but anything else will unbalance the unit and lead to inevitable lock)\n\nI chose not to beacon the print, but it's designed to take a full row either side, module it up and fill these in yourself as and when you have such things.  If you underground the u-238 line you can push it all the way to 10 beacons per centrifuge.\n\n+Pros:\n\nEvery produced u-235 is available to start centrifuges running, none is buffered anywhere in the system.  (The nth centrifuge is primed by n-1 u-235 per cycle, for the final two in the chain this translates to just 4 cycles each to prime from 'cold')  Note that the system will occasionally 'overprime' a centrifuge and leave it with a couple of extra, this causes no issues and is due to the variable amounts each is primed with not always being factors of 40. (math stuff)  This will stick in the centrifuge, but not increase.\n\nRequires no further u-235 after initial 40.\n\nCan take 10 beacons per centrifuge to run up past 1 per second.\n\nNo circuit reliance\n\n-Cons:\n\nThis is not a tileable setup as every centrifuge has custom stack sizes,  \n\nYou cannot add more centrifuges without tweaking the design by adding a second onwards-output and balancing it's numbers vs the recirculating outputs.\n\nThe system is not able to handle continuous u-235 input.  You can handload to speed up priming and doing so will not break anything as long as you do not give more than 40 to any 1, but do not 'feed' the first centrifuge u-235 in any other fashion after startup.\n\nEvery centrifuge is interdependant and relies on the output of the machine to it's left for a chunk of it's input, all 'final product' comes from the single centrifuge at the end of the line.  Always think of this as 1 'device'.  Introduced faults propagate rapidly and will cut the output (u-238 shortage on reversed belt/u-235 overfeeding/uneven speed boosting, all will eventually lead to some kind of problem as it de-synchs). \n\nYou REQUIRE the ability to use stack size 10 on stack inserters, the blueprint assumes max tech (remove 2 centrifuges for 10 or it may backup).  Going below stack size 10 requires tweaking the design.  To be painfully clear, the print will not work correctly without this tech.\n\n\nYes, sorry, I realise this is a huge and complicated list of instructions for a row of 12 centrifuges, it's the method I use to avoid the internal buffer that leads to all this since it's so interlinked.  I dont want to give the wrong idea, it's very reliable as long as you keep it fed with the dark green and dont break the synch, but when it goes wrong you need to rebalance the u-235, it wont 'clear' itself.  (The only fault that does not need the player is u-238 shortage with correct belt direction, this just slows it and it will resynch over time)\n\nFault Diagnosis:\n\nYou can always tell when the system is not balanced because there will be u-235 on the belts and no inserter taking it, or a centrifuge in the middle of the chain not running because it lacks 40x u-235.  \n\nVisible bright green means someone is buffering and backing up, so unless the u-238 belt is reversed and previously ran dry or bright green has been added the output must itself be backed up, you need to pull all the excess out of the system, it will resynch its timing eventually after that.  Visible u-235 is a serious issue, even if the centrifuges are currently running they will eventually stop as the machine to their right fills it's belt.\n\nA centrifuge in the middle of the chain not running is acceptable for brief moments, it is waiting for the machine to it's left to output, and this event ripples along the chain right-to-left under normal use.  If it needs to wait longer than a second or two then there is probably a u-238 shortage/backup, or the system is currently recovering it's synch after another event, during which it will stutter a bit.\n\nIf you have any troubles or have questions, drop a comment or send a message.\n\n(making a 24-long chain, or creating a blueprint compatible with slightly lower stack size tech (can probably do 6) is possible with some minor changes, if you need this, give me a shout)",
  "image": {
    "height": 250,
    "id": "CweI8pr",
    "type": "image/jpeg",
    "width": 1121
  },
  "lastUpdatedDate": 1522073694385,
  "tags": {
    "1": "/mods/vanilla/",
    "2": "/version/0,15/",
    "0": "/power/kovarex enrichment/"
  },
  "author": {
    "userId": "duVWG6DfCxMHjqWcEQen4cnW4WA2"
  },
  "blueprintString": "0eNq9XdFuGzkM/JVin2NgSa2kVX7lUBSOu20XdezAdoLmivz7rRPn6hayOkNbfiraIGMuxeGS1JT+2dwtH4eHzbjaNbc/m3GxXm2b239+Ntvx62q+3P/b7vlhaG6bcTfcNzfNan6//9uX+XY3223mq+3DerOb3Q3LXfNy04yrz8OP5lZebv6KsBhWu8345fHrcPSL+vLxppl+MO7G4c2O1788f1o93t8Nmwm5aMFN87DeTr+7Xu0/dsKbuXDTPO//nD7j87gZFm8/DHsD/4BWFtrD0I6F7mDojoV2MLRnoRWGDix0C0NHFlpg6J6E1gRDJxa6h6GlZbFxzgjLR404NktIxVkjLCMVJ7uwlFScN8JyUnG6C0tKxUkpLCsVZ6WwtBSCOywvBae8srwU4l3G8lJwXirLS8F5qSwvBeelsrwUnJfK8lJwXirLS8F5qSwvBeelsrzEaaksLXFWOpaVOCkdS0qck47lJE5Jx1KSKIvpNyUOTRevODTJR5yNjmYjDk2SkfA0yUXc5o6kItE0kUzEg6MjiYhnj47kIU7DjqQhnqc7koV4wutIEhLvxI5kIf5u6UgSEgVIx7IQp6EnaUiUe57kIVE1eZKIRHHtSSYSNaonqUi0Mp7kItEReJKMROPoSTIS/ZdnX4kEZUg2EhOAQLKRGIoEko3EbCGQbCRGUIFkIzHJCSQbiaFcINlIzM0CyUZithpINhID0ECykRk2k2wkJsKRZCMxfY9sjYoTPZJsJG46ostd8Jy8hmgnxAlvfL0f+r5+mm+GH7NhtRkX3+6nX589bNaLYbttcp/0BznH1XbY7KafnL7z0JcczhETx+UEUETSd6TfPDGZ8va7b3dW77dg/wM/Tg4eH+9n6vrm5WPOiIC57ZAGznFbJB73PQ1f/HF7+OzeE1/+7BLoNjnXbX3LuK2t47ZecLdJwW29Ym47FK7nuM0RbntvHC7uNjxTvJfqebd5zG3pbK8F2OBUspehel/J9z34PjjbZ4khaJ2HTS3+SiqcWxLIZ2e7LCnuskrUTA71WNFhHeSws3mZiFJBKr0DEpwbSqkhRchj578AUk+4rFK1kRLqsmL6l7aFnHZ+sSGt4F7TSslMWkXdViw2pMVagvNLW2k7wm19Lbd52G2x6DasJTi/kZKWqBNcV8ttcEtQ7OakTTaFYJtFo7VTBzTJo/1yyHY3X3yfAQ2nP+D95m6F3e2bvaJy/TRsNuPn4dPrx37ajv8Oe1dlbdQ/bPy7cS2iE3P8o0vu0cNFHj1rYmcTJZ44a29DOxGHv5LB9n6+XM6G5eSQid2zh/VyOO28E2iRPozDJO+KcdjjcagJj8PEP7qvFoealT22Nt1jPg5pJdgBLR85R9ovLA7Vl9D4pHC4c7heHB6pxv4ehw6OwyPBGProkqrFocuaGGy6yhNxGG1oJyKnJ+NQUgmNTwqH29HrxeGRLu2vcSgRjkPHlyTiqsVhlzVRbbrN/FnTcrYDWj6qjxRsYBy6km2GpCDXjsNAxKHgcciXJLFaGPqshb1JGHripJMJLB+ERzo5LAhjwbKOTwjXblE6okXBO5SOL0bqNSh5CzuL8PTEMXsL1on4Y5uTUm/S0Yng2hmwwzsTPP91dAlSryuJ2f941FqErfkzZmV/peTnyY6k1I94OgVcuwr0eDeC14CeLjukXubrsxYGk3D2xClHE9iJ8CMbESnlPk8nAbl2OxzwNkTwbjjQRYfUq/5S1kI1CXPz58xKFouNdSBbEClVf4FPBdceDAa8ARF8LhjoskPrtcEnHrw3KX9PRE0ygeWjJpINiJaa4EjnAr12AxLxBkTxBiTS1YfWmwhK9ookdiZp8YmD9iawfDxHsgfR0jww0snAXbsJiXgT4vAu5EhPuVx/Hbe7yX+Lb8N0OA/z7XZ8Gvb3yE+ThbmPKVXpfUt7tF5/I9lrlyNxJRRBrtRJ9Gq7N3Z5NGdDy9+Q951t0Q20isGz95S+ZGmw7c2BLOUHjgf0vfShFq373rbOB3pi/pbjgF7ziVNr2zIELe8w6C20/hOrTRmQzw3J2dDyjEsdfyPb1/eYty1egmIk2DYvQdiRvS1PpbPpbbuWIEuTbUcUtOam5WMqXDCmUtYoPjUc3Fkx0LU1rrzKpgZtnQ1N82iG1KD1PeZty7agwA22ZVsQNp0aXOlsev5spP7ZGLRW7QWt6rOLsVrbljNo6ZbYtpxB2GrTz+RTA73/TvpC+AmfGiRUDz9agSn4O43elScRx2ZTg8TS2fCpQXz9szEori7ZfcXsXrvWttgO2pkntsV2ELZRIJUPGDUKpPKJRg2poa0efsqOKURKHjMu6IPO1rigD8LmU0OqfzR8ZrhkA5pfStmaNhlC+y7FtMkQglaTxizPY1o2WZhAquOTQvXRm9IbA/Hk71iBlC85L5r2MUJ28gnB1T8XQxdxQaN8dpNsa1pcCS2pFdPiSghaLZq/fBSy2wgLI0zt6HRQf67A6iOJAyaTQanyYFcV4rVBR6eC+pmA10he8q3RZdc+m1aUQgulTStKIWTTitJ8ALKrEEslhqfTQPWbB2WXJuKFHytpxOcHnpwflKYHnk4D9TsEg0rykh2ly65ob03raKHt72JZRwshq0kIm2cvrWkszSACnQqkfoPArmwkpkOBrQlKlwHskkbBXx2BTgdXmCUGPh9ccvis2a9VaE3bh6FvbBDT9mEI2iZyzodhtImc89kl8i1C/SkiK2AkbpJYOaOk0knYdihDdtIJ4Qr3jpFOCJe9qM5+F0pr2ggNfc2KmPZYQ9BqUonnw5BVMRa1DayIkdCr9N60UBqCDnRk1r8n7cl+QUvTSVbAiKuptE+mldnQ1wnREqWLioGyCiVevHhZJV7WJjVJ9vOhwioXSzJITZ1pxzcUHN60mRyCpvNBfX2qsqpFV5pQsqJFXMGtrGYRl0o7XrJ4UaV0n7WJzgeX1avvf/L6Db63R18ZfNMs55O3f+0cXHybj6sPd88fFlPU7L/td8Lavjm6jypOJHbh5eU/o9ApPw==",
  "createdDate": 1521001677323
}
