{
  "tags": {
    "0": "/circuit/indicator/",
    "1": "/mods/vanilla/",
    "2": "/version/1,1/"
  },
  "title": "BRAG Display System",
  "author": {
    "userId": "JS3xB4ApyfeKYh0kVKvk0Wj9EXC3"
  },
  "authorId": "JS3xB4ApyfeKYh0kVKvk0Wj9EXC3",
  "createdDate": 1484689685482,
  "descriptionMarkdown": "**UPDATED** 08-Mar-2024 for factorio v1.1 compatability (previously v0.14)\n\nA combinator contraption in 3 parts to allow a BRAG (Blue Red Amber Green) display of any item counts in your factory. Has a variety of uses, the most common being a method of showing ore levels in far flung outposts, displayed at the place that the ore is unloaded and consumed. (Throughout this description, 'ore' and 'ore type' are mentioned, but this system works for anything, such as plates, plastic, sulphur, fluid levels, etc.)\n\nThe system comprises a combinator contraption that sends a BRAG indicator, and a receiver that displays the BRAG. You can place as many senders as you like in the factory, you should have have 1 receiver 'row' per sender where you display what is being sent.\n\nOne blueprint is provided for all 3 parts to this system. You will need to create 3 separate blueprints from the one supplied. Each blueprint is shown in the screenshot, bounded by 'hazard' concrete (which is not included in the blueprint)\n\nHOW TO USE THE  'sender'\n\nThe sender is the combinator contraption in the left hand hazard box. Use it as follows.\n\nOn the right is a constant combinator. You should edit 3 of the variables in the combinator when you place the blueprint\n\n'R' is the level of ore in the chests which will cause a red light to show at the factory if the ore stored is less than this.\n\n'A' is the level of ore in the chests which will cause an amber light if the ore is between 'R' and 'A', and a green light if the ore is greater than 'A'.\n\n'4' is the Sender coefficient. Sender 1 '4' = 4, Sender 2 '4' = 4x4 = 16, Sender 3 '4' = 4x4x4 = 64, etc.\n\nOn the left is the combinator column that computes what is sent back to the factory from the bottom combinator.\n\nHOW TO SET UP A sender\n\n1) Place the blueprint.\n2) Send your ore count on a green wire to the top combinator.\n3) Click the top combinator and change to the correct ore type for your outpost\n4) Click the bottom combinator to set the ore type for your outpost\n5) Send the output from the bottom combinator on a green wire back to the master receiver at the factory\n\nHOW TO USE THE 'master receiver'\n\nThe master receiver is the combinator contraption in the lower right hazard zone on the screenshot. You will need one of these receivers for each ore type you want to display. So for example if you are sending BRAG data from iron, copper and coal outposts, you'll need 3 master receivers.\n\nHOW TO SET UP A master receiver\n\n1) Place the blueprint anywhere in your factory\n2) Connect the bottom combinator to the green wire that is sending all the ore counts from all your senders\n3) Click the bottom combinator and change the ore type for this receiver\n\nOnce complete, this master receiver show the BRAG display for the sender where the sender and receiver ore type are the same, and where the sender '4' value is 4.\n\nHOW TO USE THE' addon receiver'\n\nThe addon receiver is the combinator contraption in the top right hazard zone on the screenshot. It allows an additional row of lights to be added to the mast receiver. You should add a row of addon receivers for every sender of the ore type you are displaying.\n\nHOW TO SET UP AN addon reciever\n\n1) Hover the blueprint, so the bottom 2 rows of the combinators overlap EXACTLY the top row of the previous receiver.\n2) Shift click to place the blueprint. Note that this adds 1 extra row but the blueprint has 2 rows. This is as intended.\n3) Repeat 1) and 2) as many times as you like until you have the same number of rows as you have senders for this ore type.\n\nEnjoy the BRAG light show!\n\nOn each receiver row:\n\nA Blue light means that this sender is not connected to the network. Check that a green wire is connected all the way from the sender to the receiver, and check that the '4' variable is set correctly. Moving upwards from the master receiver, for each row, the '4' vriable should be 4, 4x4, 4x4x4, 4x4x4x4 etc. In other words'4' = 4^(master receiver light row number).\n\nA Red light means that the sender ore level is lower than 'R'\n\nAn Amber light means that the ore level is higher than 'R' but lower than 'A'\n\nA Green light means that the sender ore level is higher than 'A'\n\n\n",
  "lastUpdatedDate": 1709823190558,
  "numberOfFavorites": 8,
  "blueprintString": "0eNrtW11r4zgU/SuDHnftGUuyEzvMLHQp7NOwQ19LCU6itgJ/IdvdDSX/fWW7TR1/6irZpLR+KTiJrqxzdHSPdNVntApylggeZWjxjPg6jlK0uH1GKX+I/KD4LNsmDC0Qz1iIDBT5YfHkC549hizja3Mdhyse+Vks0M5APNqwf9EC74zRGBu25hsmugOQ3Z2BWJTxjLPqjcqH7TLKwxUTsod9nDT0g8AM/DCRsZM4lU3iqOhVhrG+OgbaooVpf3VkcDm8TMTBcsUe/ScuO5S/WnOxznm2lN9t9k3vuUizZWsAT1xkufzkre/yF6YfbbNHHj2gqo808ws8reIhTHxRjm2B/ii+zlMmuwpiIUeViZxVLSK2LrpOi75w8edBMBbVx803EhRj/7bl4+5utyuAbkBDhiBuQUTqAG24qN4ELWbdcL2EfIMr1cDr70OgaAOoH7JBnGdJDghZAVaGTbby7fIoW96LOFzySMZBi3s/SNkOgjY9RBvXkC6evTYZBiK90ZrNqRqXFMSlfXkuyQm43LIgiP85KZlkmEy7+fUwmS0hDkbr49YGcTu7PLf4BNwKtjmnSh0YsXSYWEeNWAdErHt5Yq0TEFsYiZMyC9SkouhmMN9APoJvcNWgme9fL2QbnocmC2R4IT1eEgesDRJ+BYlKkDriuTo+hEw+pOkcrOElDs9hTmTWbG+pTQ9vxP33uRGqyOhb1BOQmrIihnqjX0WjOGGS+vIdkanBvey5j9ki7TV5bTtIo2cGYBjDpL1ydhFaEA83l2QylyPra0ugBJbJ3GETghW3gRhDBTu7vGDfuLYP9fibBtW/+vXYrTMK05mnqDOiY/TJZPRhaRDoF9tpbzher8woVGbuO5bZt0ukvWGesKLKbJ1dF5l2XbdHJSvlbOQAdxfeyO4Cz6C6M184t/4n4R0eb0tGpK7MWLBO3VmHuvv9ZLobsIWWopLmmk4fT06/TyUubNFzFZlyNS0e/rQWD5p95opMeJouAH9sF0B6XIA3YuZax7q9e2NFqRDYZvclV1hntwfQ5eyqyv41G/Fdgzw84CHK00aQxmbDzprgYfIJHTvfwIqFUKzDOX73nN+8P867vIUB8CKtOTJTlDUB2krTefGVuNtWElpzcNXyODxpXuOpLhX3PMiY6Lll0ceVXXGVl5vz2cg1ixHCyyAmrl21gAS5qQWxLcvah6GgMFf1AZF6HLucOUdMvMZEUkzgxNasfvTNI939Dn6tOCnWP1Xzn+52iZzZoOBOg0KP3y5dA60igZ66q860uSYT5z4wutbJTXZze6Xj6n9CqaIj6WOMO6qablxQ+fhDVI+Jp+i2PI1671TubU3FEWdEMdBpuSMBeq+eWXrHQFO9t5fakXtjFFjJJ4oFKIo1Cr1TnVcB7wZ/FChNb2Q+qF4SJXrHgJ+20EttoD1QPDmnVKPSOxV6b0cSXEMV0DudeERlirc6qa13xPsZ6rzdwAPTGVW8t0R17tdOhd4m2sBkpZyMdA8a7DPr5Oexddn+ei/MVcwVgZ3rZXn7064/7rFZ3hh0Db3rk6uXKOz3cC8BH+/GoDwRZ4yYzpO1O6Ma2aL2P4wGCvwVky+J/ry5+uvLNU+TwN9+SbdphcETE2k5MOJie+6RuUsodhyy2/0HMVGWDQ==",
  "fileName": "BRAGDisplaySystem.PNG",
  "image": {
    "type": "image/jpeg",
    "width": 1349,
    "height": 890,
    "id": "KlfUKs6"
  },
  "imageUrl": "https://firebasestorage.googleapis.com/v0/b/facorio-blueprints.appspot.com/o/BRAGDisplaySystem.PNG?alt=media&token=386811b9-45be-4b7b-b9c6-ce2269498f69",
  "favorites": {
    "XM7y0B8i81dIrOKaj80YN5xMuYp2": true,
    "xnDczljc7leQ8J0Hxm8nXnD6HPB3": true
  }
}
